tap "buildpacks/tap"
tap "charmbracelet/tap"
tap "chipmk/tap"
tap "cirruslabs/cli"
tap "felixkratz/formulae"
tap "glasskube/tap"
tap "hashicorp/tap"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "mocki-toki/formulae"
tap "nikitabobko/tap"
tap "skatkov/tap"
tap "sst/tap"
brew "act"
brew "age"
brew "age-plugin-se"
brew "ansible"
brew "argo"
brew "argocd"
brew "asciidoctor"
brew "autoconf"
brew "bash"
brew "autoenv"
brew "automake"
brew "awscli"
brew "awscurl"
brew "azure-cli"
brew "bat"
brew "blueutil"
brew "brightness"
brew "cheat"
brew "gcc"
brew "checkov"
brew "chezmoi"
brew "clipboard"
brew "codespell"
brew "curl"
brew "composer"
brew "container", link: false
brew "copilot"
brew "coreutils"
brew "cyphernetes"
brew "dasel"
brew "deno"
brew "difftastic"
brew "direnv"
brew "dive"
brew "dnsmasq"
brew "docker"
brew "docker-compose"
brew "docker-machine-driver-vmware"
brew "dotnet"
brew "duf"
brew "dust"
brew "eza"
brew "fd"
brew "snappy"
brew "freerdp"
brew "fzf"
brew "gh"
brew "git-delta"
brew "glow"
brew "gnupg"
brew "go"
brew "graphviz"
brew "hcloud"
brew "helix"
brew "helm"
brew "helmfile"
brew "htmlq"
brew "htop"
brew "httpie"
brew "hugo"
brew "hyperfine"
brew "ipcalc"
brew "istioctl"
brew "jq"
brew "just"
brew "k6"
brew "k9s"
brew "keychain"
brew "kind"
brew "kubernetes-cli"
brew "krew"
brew "kube-linter"
brew "kubebuilder"
brew "kubecolor"
brew "kyverno"
brew "lazygit"
brew "libyubikey"
brew "lima"
brew "lunchy"
brew "node"
brew "marp-cli"
brew "minikube"
brew "mise"
brew "most"
brew "navi"
brew "ripgrep"
brew "nb"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "nvtop"
brew "ocm"
brew "openshift-cli"
brew "openssh"
brew "opentofu"
brew "osx-cpu-temp"
brew "pinentry-mac"
brew "pipx"
brew "plantuml"
brew "pnpm"
brew "podman"
brew "poetry"
brew "pylint"
brew "qemu"
brew "rio-terminal"
brew "rosa-cli"
brew "rustup"
brew "sd"
brew "shellcheck"
brew "shpotify"
brew "smug"
brew "sonar-scanner"
brew "starship"
brew "subversion"
brew "switchaudio-osx"
brew "tektoncd-cli"
brew "terraform"
brew "terraform-ls"
brew "terragrunt"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "tmuxp"
brew "topgrade"
brew "tpm"
brew "transmission-cli"
brew "typescript"
brew "universal-ctags"
brew "uv"
brew "vegeta"
brew "vfkit"
brew "virtualenv"
brew "volta"
brew "watch"
brew "xh"
brew "ykman"
brew "yq"
brew "yubico-piv-tool"
brew "zenith"
brew "zoxide"
brew "zplug"
brew "zsh"
brew "buildpacks/tap/pack"
brew "charmbracelet/tap/crush"
brew "chipmk/tap/docker-mac-net-connect"
brew "cirruslabs/cli/tart"
brew "felixkratz/formulae/sketchybar"
brew "glasskube/tap/glasskube"
brew "hashicorp/tap/hcp"
brew "hashicorp/tap/packer"
brew "sst/tap/opencode"
cask "amethyst"
cask "antigravity"
cask "balenaetcher"
cask "bartender"
cask "betterdisplay"
cask "captin"
cask "chatgpt"
cask "claude-code"
cask "cleanshot"
cask "cloudflare-warp"
cask "container"
cask "dbeaver-community"
cask "devtoys"
cask "discord"
cask "dropbox"
cask "ente-auth"
cask "expressions"
cask "firefox"
cask "fliqlo"
cask "flux-app"
cask "font-caskaydia-cove-nerd-font"
cask "ghostty"
cask "gimp"
cask "github"
cask "gitkraken"
cask "google-chrome"
cask "google-drive"
cask "halloy"
cask "imageoptim"
cask "inkscape"
cask "iterm2"
cask "keyboardcleantool"
cask "keycastr"
cask "libreoffice"
cask "logi-options+"
cask "logitech-g-hub"
cask "mac-mouse-fix"
cask "maccy"
cask "macfuse"
cask "meetingbar"
cask "microsoft-auto-update"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "mockoon"
cask "muzzle"
cask "netnewswire"
cask "ngrok"
cask "obsidian"
cask "oracle-jdk"
cask "orbstack"
cask "orion"
cask "parallels"
cask "prettyclean"
cask "pronotes"
cask "proxyman"
cask "quicklook-json"
cask "quicklookase"
cask "spotify"
cask "stats"
cask "steam"
cask "swift-quit"
cask "switchhosts"
cask "telegram"
cask "transmission"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "wezterm"
cask "whatsapp"
cask "xquartz"
cask "yaak"
cask "yubico-authenticator"
cask "zoom"
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "angelomollame.conflict-squeezer"
vscode "asciidoctor.asciidoctor-vscode"
vscode "betajob.modulestf"
vscode "cadnza.asciidoc-author"
vscode "codezombiech.gitignore"
vscode "dart-code.dart-code"
vscode "editorconfig.editorconfig"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "jebbs.plantuml"
vscode "kennylong.kubernetes-yaml-formatter"
vscode "ldez.ignore-files"
vscode "maciejdems.add-to-gitignore"
vscode "mikestead.dotenv"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azure-mcp-server"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azureterraform"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-containers"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.vscode-typescript-next"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "parallelsdesktop.parallels-desktop"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "redhat.vscode-tekton-pipelines"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "saoudrizwan.claude-dev"
vscode "skellock.just"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-portuguese-brazilian"
vscode "techer.open-in-browser"
vscode "vadimcn.vscode-lldb"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "wayou.vscode-todo-highlight"
go "cmd/go"
go "cmd/gofmt"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
