tap "buildpacks/tap"
tap "cirruslabs/cli"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "mocki-toki/formulae"
brew "act"
brew "asciidoctor"
brew "autoconf"
brew "bash"
brew "autoenv"
brew "automake"
brew "awscli"
brew "awscurl"
brew "azure-cli"
brew "bat"
brew "cheat"
brew "checkov"
brew "chezmoi"
brew "clipboard"
brew "codespell"
brew "lima"
brew "colima"
brew "composer"
brew "dasel"
brew "deno"
brew "difftastic"
brew "direnv"
brew "dive"
brew "dnsmasq"
brew "docker-compose"
brew "dotnet"
brew "duf"
brew "dust"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git-delta"
brew "glow"
brew "gnupg"
brew "go"
brew "helix"
brew "helm"
brew "htmlq"
brew "htop"
brew "httpie"
brew "hugo"
brew "hyperfine"
brew "jq"
brew "just"
brew "k9s"
brew "keychain"
brew "kubernetes-cli"
brew "krew"
brew "kube-linter"
brew "kubecolor"
brew "lazygit"
brew "libyubikey"
brew "lunchy"
brew "mise"
brew "most"
brew "navi"
brew "ripgrep"
brew "nb"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "node"
brew "nvtop"
brew "openssh"
brew "opentofu"
brew "pinentry-mac"
brew "pipx"
brew "plantuml"
brew "pnpm"
brew "poetry"
brew "pylint"
brew "rustup"
brew "smug"
brew "snappy"
brew "starship"
brew "subversion"
brew "tektoncd-cli"
brew "terraform"
brew "terraform-ls"
brew "terragrunt"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "tmuxp"
brew "topgrade"
brew "tpm"
brew "typescript"
brew "universal-ctags"
brew "virtualenv"
brew "volta"
brew "xh"
brew "yarn"
brew "ykman"
brew "yq"
brew "yubico-piv-tool"
brew "zoxide"
brew "zplug"
brew "zsh"
brew "buildpacks/tap/pack"
brew "cirruslabs/cli/tart"
brew "felixkratz/formulae/sketchybar"
brew "hashicorp/tap/hcp"
cask "alt-tab"
cask "amethyst"
cask "apache-directory-studio"
cask "apparency"
cask "balenaetcher"
cask "bartender"
cask "betterdisplay"
cask "bruno"
cask "captin"
cask "chatgpt"
cask "cleanshot"
cask "coteditor"
cask "cursor"
cask "dbeaver-community"
cask "devtoys"
cask "discord"
cask "docker"
cask "dropbox"
cask "ente-auth"
cask "expressions"
cask "firefox"
cask "fliqlo"
cask "flux"
cask "font-caskaydia-cove-nerd-font"
cask "ghostty"
cask "gimp"
cask "gitbutler"
cask "github"
cask "google-chrome"
cask "google-drive"
cask "inkscape"
cask "insomnia"
cask "intellidock"
cask "iterm2"
cask "keyboardcleantool"
cask "krisp"
cask "libreoffice"
cask "logi-options+"
cask "mac-mouse-fix"
cask "maccy"
cask "meetingbar"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "muzzle"
cask "netnewswire"
cask "obs"
cask "obsidian"
cask "oracle-jdk"
cask "parallels@19"
cask "pearcleaner"
cask "pinta"
cask "podman-desktop"
cask "prettyclean"
cask "proxyman"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "rapidapi"
cask "raycast"
cask "rectangle"
cask "rustdesk"
cask "slack"
cask "spotify"
cask "stats"
cask "steam"
cask "suspicious-package"
cask "swift-quit"
cask "switchhosts"
cask "telegram"
cask "utm"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "wezterm"
cask "whatsapp"
cask "wireshark"
cask "xbar"
cask "yubico-authenticator"
cask "zoom"
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "asciidoctor.asciidoctor-vscode"
vscode "beardedbear.beardedtheme"
vscode "betajob.modulestf"
vscode "cadnza.asciidoc-author"
vscode "catppuccin.catppuccin-vsc"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codeium.codeium"
vscode "codezombiech.gitignore"
vscode "dart-code.dart-code"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "ekeel.groovy-beautify"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "jebbs.plantuml"
vscode "kennylong.kubernetes-yaml-formatter"
vscode "ldez.ignore-files"
vscode "maciejdems.add-to-gitignore"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "mushan.vscode-paste-image"
vscode "naumovs.color-highlight"
vscode "nicolasvuillamy.vscode-groovy-lint"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "parallelsdesktop.parallels-desktop"
vscode "piousdeer.adwaita-theme"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "redhat.vscode-tekton-pipelines"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "skellock.just"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-portuguese-brazilian"
vscode "swellaby.rust-pack"
vscode "syler.ignore"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "techer.open-in-browser"
vscode "tim-koehler.helm-intellisense"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "waderyan.gitblame"
vscode "wayou.vscode-todo-highlight"
vscode "wholroyd.jinja"
vscode "xabikos.javascriptsnippets"
vscode "yzhang.markdown-all-in-one"
vscode "zignd.html-css-class-completion"
