# =============================================================================
# TAPS
# =============================================================================
tap "anomalyco/tap"
tap "argoproj/tap"
tap "bendews/tap"
tap "buildpacks/tap"
tap "charmbracelet/tap"
tap "hashicorp/tap"
tap "libkrun/krun"
tap "nikitabobko/tap"
tap "typewhisper/tap"
tap "xo/xo"

# =============================================================================
# CORE UTILITIES
# =============================================================================
brew "bash"
brew "zsh"
brew "coreutils"
brew "curl"
brew "openssh"
brew "gnupg"
brew "gcc"

# =============================================================================
# DEVELOPMENT TOOLS
# =============================================================================
brew "act"
brew "age"
brew "ansible"
brew "argo"
brew "argocd"
brew "asciidoctor"
brew "autoconf"
brew "automake"
brew "awscli"
brew "awscurl"
brew "azure-cli"
brew "bandwhich"
brew "bat"
brew "bitwarden-cli"
brew "blueutil"
brew "bottom"
brew "brightness"
brew "btop"
brew "chafa"
brew "chezmoi"
brew "clipboard"
brew "cmake"
brew "code-minimap"
brew "composer"
brew "codespell"
brew "cosign"
brew "d2"
brew "dasel"
brew "difftastic"
brew "direnv"
brew "displayplacer"
brew "dive"
brew "dnsmasq"
brew "docker"
brew "docker-compose"
brew "doggo"
brew "dotnet"
brew "duckdb"
brew "duf"
brew "dust"
brew "exiftool"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fx"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gitleaks"
brew "glab"
brew "glow"
brew "graphviz"
brew "gum"
brew "hcloud"
brew "helix"
brew "helm"
brew "helmfile"
brew "htmlq"
brew "httpie"
brew "hugo"
brew "hyperfine"
brew "imagemagick"
brew "ipcalc"
brew "istioctl"
brew "jc"
brew "jj"
brew "jq"
brew "jsongrep"
brew "just"
brew "k6"
brew "k9s"
brew "kind"
brew "krew"
brew "kube-linter"
brew "kubecolor"
brew "kubernetes-cli"
brew "kustomize"
brew "kyverno"
brew "lazydocker"
brew "lazygit"
brew "libyubikey"
brew "lima"
brew "litecli"
brew "lnav"
brew "mas"
brew "mimo-code"
brew "minikube"
brew "mise"
brew "mole"
brew "mtr"
brew "mycli"
brew "ncdu"
brew "neovim"
brew "nload"
brew "nmap"
brew "nvtop"
brew "ocm"
brew "ollama", restart_service: :changed
brew "openshift-cli"
brew "openssl"
brew "opentofu"
brew "pass"
brew "pgcli"
brew "pinentry-mac"
brew "plantuml"
brew "podman"
brew "postgresql@17"
brew "procs"
brew "pulumi"
brew "redis"
brew "ripgrep"
brew "rosa-cli"
brew "rsync"
brew "sd"
brew "sem-cli"
brew "shellcheck"
brew "smug"
brew "sops"
brew "sqlite"
brew "starship"
brew "stern"
brew "tektoncd-cli"
brew "tldr"
brew "tmux"
brew "topgrade"
brew "tpm"
brew "trivy"
brew "trufflehog"
brew "typst"
brew "universal-ctags"
brew "xo/xo/usql", trusted: true
brew "vfkit"
brew "watch"
brew "websocat"
brew "wget"
brew "xh"
brew "yazi"
brew "ykman"
brew "yt-dlp"
brew "yubico-piv-tool"
brew "zoxide"
brew "anomalyco/tap/opencode", trusted: true
brew "argoproj/tap/kubectl-argo-rollouts", trusted: true
brew "bendews/tap/apw", trusted: true
brew "buildpacks/tap/pack", trusted: true
brew "charmbracelet/tap/crush", trusted: true
brew "hashicorp/tap/hcp", trusted: true
brew "hashicorp/tap/packer", trusted: true
brew "libkrun/krun/gvproxy", trusted: true
brew "libkrun/krun/krunkit", trusted: true
cask "balenaetcher"
cask "bartender"
cask "betterdisplay"
cask "captin"
cask "chatgpt"
cask "claude-code"
cask "cleanshot"
cask "copilot-cli"
cask "dbeaver-community"
cask "devtoys"
cask "discord"
cask "drawio"
cask "dropbox"
cask "espanso"
cask "expressions"
cask "finetune"
cask "firefox"
cask "fliqlo"
cask "flux-app"
cask "font-caskaydia-cove-nerd-font"
cask "font-liberation"
cask "font-liberation-nerd-font"
cask "font-maple-mono-nf"
cask "font-symbols-only-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "gimp"
cask "gitbutler"
cask "github"
cask "google-chrome"
cask "handbrake-app"
cask "iina"
cask "imageoptim"
cask "inkscape"
cask "itsycal"
cask "keyboardcleantool"
cask "keycastr"
cask "keepingyouawake"
cask "keka"
cask "latest"
cask "logi-options+"
cask "logitech-g-hub"
cask "mac-mouse-fix"
cask "maccy"
cask "macfuse"
cask "microsoft-auto-update"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "mos"
cask "muzzle"
cask "netnewswire"
cask "ngrok"
cask "nikitabobko/tap/aerospace", trusted: true
cask "obs"
cask "obsidian"
cask "onlyoffice"
cask "onyx"
cask "parallels"
cask "podman-desktop"
cask "prettyclean"
cask "pronotes"
cask "proxyman"
cask "raycast"
cask "reminders-menubar"
cask "rustdesk"
cask "shortcat"
cask "skim"
cask "slack"
cask "sloth"
cask "spotify"
cask "stats"
cask "swift-quit"
cask "telegram"
cask "the-unarchiver"
cask "thunderbird"
cask "transmission"
cask "typewhisper/tap/typewhisper", trusted: true
cask "virtualbox"
cask "visual-studio-code"
cask "vnc-viewer"
cask "vlc"
cask "whatsapp"
cask "yaak"
cask "yubico-authenticator"
cask "zed"
cask "zen"
cask "zoom"

# =============================================================================
# MAC APP STORE (mas)
# =============================================================================
mas "Bitwarden", id: 1352778147
mas "Magnet", id: 441258766
